dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
STATIC uint32_t start_i2c_bus_write(mp_obj_t *self_in, uint8_t first_byte)
{
    uint32_t err_code = 0;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // mp_printf(MP_PYTHON_PRINTER, "register address send reached\nsize of data buffer: %d\n", size);
    // memory location to be written to
    I2CMasterDataPut(self->i2c_base, first_byte);

    // send start condition, address byte and bit for write direction to slave device
    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_START);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    err_code = I2CMasterErr(self->i2c_base);
    if (err_code != I2C_MASTER_ERR_NONE)
    {
        // if error occured, cancel write routine
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
        return err_code;
    }

    // return error code
    return err_code;
}

STATIC uint32_t i2c_single_write(mp_obj_t *self_in, uint8_t i2c_data)
{
    uint32_t err_code = 0;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // memory location to be written to
    I2CMasterDataPut(self->i2c_base, i2c_data);

    // send start condition, address byte and bit for write direction to slave device
    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_SINGLE_SEND);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    err_code = I2CMasterErr(self->i2c_base);
    if (err_code != I2C_MASTER_ERR_NONE)
    {
        // if error occured, cancel write routine
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
        return err_code;
    }

    // return error code
    return err_code;
}

STATIC uint8_t i2c_write_bytes_to_bus(mp_obj_t *self_in, uint8_t *i2c_data, size_t size)
{
    uint32_t err_code = 0;
    uint8_t num_of_ack = 0;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    uint8_t *local_buf;
    local_buf = i2c_data;

    for (size_t i = 0; i < size; i++)
    {
        num_of_ack++;

        // write data to FIFO
        I2CMasterDataPut(self->i2c_base, *(local_buf++));

        // send data to the slave
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_CONT);

        // wait for Master Control Unit to finish transaction
        while (I2CMasterBusy(self->i2c_base))
        {
        }

        // check for errors
        err_code = I2CMasterErr(self->i2c_base);

        if (err_code != I2C_MASTER_ERR_NONE)
        {
            // if error occured, cancel write routine
            I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);

            // return error code
            return num_of_ack;
        }
    }
    return num_of_ack;
}

STATIC uint32_t terminate_i2c_bus_write(mp_obj_t *self_in, uint8_t last_byte)
{
    uint32_t err_code;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // mp_printf(MP_PYTHON_PRINTER, "register address send reached\nsize of data buffer: %d\n", size);
    // memory location to be written to
    I2CMasterDataPut(self->i2c_base, last_byte);

    // send start condition, address byte and bit for write direction to slave device
    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_STOP);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    err_code = I2CMasterErr(self->i2c_base);
    if (err_code != I2C_MASTER_ERR_NONE)
    {
        // if error occured, cancel write routine
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
        return err_code;
    }

    // return error code
    return err_code;
}

//sends data and, if requested, a memory location (register) via I2C
void i2c_master_tx(mp_obj_t *self_in, uint8_t device_address, bool address_flag, uint16_t mem_loc, bool mem_loc_flag, uint8_t *device_data, size_t size)
{
    uint32_t err_code;
    uint8_t local_memloc_buf[2] = {0};
    uint8_t *local_data_buf;
    uint8_t i = 0;

    local_data_buf = device_data;

    // if BUS is free and no errors occured, proceed
    if (config_i2c_bus_write(self_in, device_address) == I2C_MASTER_ERR_NONE)
    {
        // single send routine
        if (size == 1)
        {
            if (i2c_single_write(self_in, *local_data_buf) != I2C_MASTER_ERR_NONE)
            {
                // if error occured, abort
                return;
            }
        }
        else
        {
            if (mem_loc_flag)
            {
                // memory location LSByte second
                local_memloc_buf[1] = (uint8_t)(mem_loc & 0xFF);

                // memory location MSByte first
                local_memloc_buf[0] = (uint8_t)((mem_loc >> 8) & 0xFF);

                err_code = start_i2c_bus_write(self_in, local_memloc_buf[0]);
                err_code = i2c_write_bytes_to_bus(self_in, &local_memloc_buf[1], sizeof(uint8_t));

                if (err_code != I2C_MASTER_ERR_NONE)
                {
                    // if error occured, abort
                    return;
                }
            }
            else
            {

                err_code = start_i2c_bus_write(self_in, *(local_data_buf++));
                i++;

                if (err_code != I2C_MASTER_ERR_NONE)
                {
                    // if error occured, abort
                    return;
                }
            }

            // send payload
            err_code = i2c_write_bytes_to_bus(self_in, local_data_buf, (size - 1) - i);
            err_code = terminate_i2c_bus_write(self_in, *(local_data_buf + (size - 1) - i));

            if (err_code != I2C_MASTER_ERR_NONE)
            {
                // if error occured, abort
                return;
            }
        }
    }
}

STATIC uint8_t initialize_i2c_bus_read(mp_obj_t *self_in, uint32_t device_address)
{
    uint8_t err_code;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

