dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
    // set slave address and initiate read
    I2CMasterSlaveAddrSet(self->i2c_base, device_address, true);

    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_START);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    err_code = (uint8_t)I2CMasterErr(self->i2c_base);

    if (err_code == I2C_MASTER_ERR_NONE)
    {
        // everything okay, return received data
        return (uint8_t)I2CMasterDataGet(self->i2c_base);
    }
    else
    {
        // something went wrong, return error code
        // mp_printf(MP_PYTHON_PRINTER, "ERROR CODE: %d\n", err_code);
        return 0x00;
    }
}

// ends i2c receive burst and returns last byte or error code
STATIC uint8_t terminate_i2c_bus_read(mp_obj_t *self_in)
{
    uint8_t err_code;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // send desired memory location to the slave (can be anything)
    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    err_code = (uint8_t)I2CMasterErr(self->i2c_base);

    // check for errors
    if (err_code == I2C_MASTER_ERR_NONE)
    {
        // if everything is fine, return final byte
        return (uint8_t)I2CMasterDataGet(self->i2c_base);
    }
    else
    {
        // if error occured, cancel write routine
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

        // return error code
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
    }
}

STATIC uint8_t i2c_single_read(mp_obj_t *self_in, uint8_t device_address)
{
    uint8_t err_code;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // set slave address and initiate read
    I2CMasterSlaveAddrSet(self->i2c_base, device_address, true);

    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_SINGLE_RECEIVE);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    err_code = (uint8_t)I2CMasterErr(self->i2c_base);

    if (err_code == I2C_MASTER_ERR_NONE)
    {
        // everything okay, return received data
        return (uint8_t)I2CMasterDataGet(self->i2c_base);
    }
    else
    {
        // something went wrong, return error code
        // mp_printf(MP_PYTHON_PRINTER, "ERROR CODE: %d\n", err_code);
        return 0x00;
    }
}

// reads number of bytes (len) from bus to address buf
STATIC void i2c_read_bytes_from_bus(mp_obj_t *self_in, uint8_t *buf, size_t len, uint8_t nack)
{
    uint8_t *buf_local;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // initialize buffer root pointer
    buf_local = buf;

    // send payload
    for (size_t i = 0; i < len; i++)
    {
        if (i == (len - 1))
        {
            I2CMasterControl(self->i2c_base, nack ? I2C_MASTER_CMD_RUN : I2C_MASTER_CMD_BURST_RECEIVE_CONT);

            // wait for Master Control Unit to finish transaction
            while (I2CMasterBusy(self->i2c_base))
            {
            }

            // check for errors
            if (I2CMasterErr(self->i2c_base))
            {
                // if error occured, cancel write routine
                I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                // return error code
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
            }

            return;
        }
        // mp_printf(MP_PYTHON_PRINTER, "rest of buffer read reached\nsize of data buffer: %d\n", len);

        // send data to the slave
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_CONT);

        // wait for Master Control Unit to finish transaction
        while (I2CMasterBusy(self->i2c_base))
        {
        }

        // check for errors
        if (I2CMasterErr(self->i2c_base))
        {
            // if error occured, cancel write routine
            I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

            // return error code
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
        }

        // get received byte from initialized I2C port
        *buf_local++ = (uint8_t)I2CMasterDataGet(self->i2c_base);
    }
}

void deinitI2C0(const mp_obj_t *self_in)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    //I2CDisable(self->i2c_base);
    SysCtlPeripheralDisable(self->periph);
}

/* --------- Binding for Micropython ------------ */
/* ---------------------------------------------- */

STATIC void machine_hard_i2c_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind)
{
    machine_hard_i2c_obj_t *i2c = (machine_hard_i2c_obj_t *)self_in;
    ;

    mp_printf(print, "I2C(%u", i2c->i2c_id);

    if (i2c->mode == I2C_MODE_MASTER)
    {
        mp_printf(print, ", I2C.MASTER)");
    }
    else if (i2c->mode == I2C_MODE_SLAVE)
    {
        mp_printf(print, ", I2C.SLAVE)");
    }
}

STATIC mp_obj_t machine_hard_i2c_init_helper(mp_obj_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
{
    enum
    {
        ARG_id,
        ARG_mode
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_id, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = I2C_0}},            // default: I2C0
        {MP_QSTR_mode, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = I2C_MODE_MASTER}}, // default: Master
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // set the I2C id value
    if (args[ARG_id].u_int > 3)
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Available I2C-Ports: 0 - 3"));
    }
    self->i2c_id = args[ARG_id].u_int;

    // set the I2C mode
    if (args[ARG_mode].u_int > I2C_MODE_SLAVE)
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Mode accepts only MASTER or SLAVE"));
    }
    self->mode = (uint16_t)(args[ARG_mode].u_int & 0xFFFF);

    // calling I2C-Init function
    InitI2C0(self);

    return mp_const_none;
}

STATIC void machine_hard_i2c_write(mp_obj_base_t *self_in, uint16_t dev_addr, bool address_flag, uint16_t reg_addr, bool mem_loc_flag, uint8_t *i2c_data, size_t size)
{
    i2c_master_tx((mp_obj_t *)self_in, dev_addr, address_flag, reg_addr, mem_loc_flag, i2c_data, size);
}

