dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
STATIC void machine_hard_i2c_readinto(mp_obj_base_t *self_in, uint8_t *buf, uint8_t buf_size, uint8_t nack)
{
    uint8_t *plocal_buf = buf;

    // just read last byte, send ack
    i2c_read_bytes_from_bus((mp_obj_t *)self_in, plocal_buf, buf_size, nack);
}

STATIC void machine_hard_i2c_readfrom_into(mp_obj_base_t *self_in, uint8_t dev_address, uint8_t *buf, uint8_t buf_size, uint8_t stop)
{
    uint8_t *local_buf = buf;

    // continue reading i2c bus
    i2c_read_bytes_from_bus((mp_obj_t *)self_in, local_buf, buf_size - 1, 0);

    if (stop)
    {
        // terminate i2c read operation with nack and stop
        *(local_buf + (buf_size - 1)) = terminate_i2c_bus_read((mp_obj_t *)self_in);
    }
    else
    {
        // terminate i2c read operation with nack
        i2c_read_bytes_from_bus((mp_obj_t *)self_in, (local_buf + (buf_size - 1)), buf_size - 1, 0);
    }
    
}

STATIC mp_obj_t machine_hard_i2c_readfrom_mem(mp_obj_base_t *self_in, uint8_t dev_address, uint16_t memaddr, size_t size)
{

    // OBACHT!
    // AN DER STELLE SOLL EIN REPEATED START PROZESS PASSIEREN.
    // DAZU MUSST DU DIE HELPER FUNCTIONS UM EINEN ÜBERGABE PARAMETER ERWEITERN: OP-CODE
    // HIER WIRD DAS MAKRO ÜBERGEBEN, DAS IN DAS MASTER CONTROL/STATUS REGISTER GESCHRIEBEN WIRD.
    // SO KANN MAN REPEATED START CONDITION ERZEUGEN, STOP CONDITION UNTERBINDEN, ETC.

    return mp_const_none;
}

STATIC mp_obj_t machine_hard_i2c_readfrom(mp_obj_base_t *self_in, uint8_t dev_address, uint8_t *buf, uint8_t nbytes, uint8_t stop)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    uint8_t *local_buffer;

    local_buffer = buf;

    // continue reading
    i2c_read_bytes_from_bus(self_in, local_buffer, nbytes - 1, 0);

    if (stop)
    {
        // terminate i2c read with stop and nack
        *(local_buffer + (nbytes - 1)) = terminate_i2c_bus_read(self_in);
    }
    else
    {
        // terminate bus read with nack
        i2c_read_bytes_from_bus(self_in, local_buffer + (nbytes - 1), 1, 1);
    }
}
}

/* MP WRAPPING FUNCTIONS*/

STATIC mp_obj_t mp_machine_i2c_stop(mp_obj_t self)
{
    i2c_start_stop_condition(self, 0);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_i2c_stop_obj, mp_machine_i2c_stop);

STATIC mp_obj_t mp_machine_i2c_start(mp_obj_t self)
{
    i2c_start_stop_condition(self, 1);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_i2c_start_obj, mp_machine_i2c_start);

STATIC mp_obj_t mp_machine_hard_i2c_readfrom_mem(size_t n_args, const mp_obj_t *args)
{

    // casting Micropython data types to c data types
    uint16_t int_dev_address = mp_obj_get_int(args[1]);
    // mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
    uint16_t int_memaddr = mp_obj_get_int(args[2]);
    // mp_printf(MP_PYTHON_PRINTER, "nbytes: %d\n", int_nbytes);
    uint8_t int_nbytes = mp_obj_get_int(args[3]);
    // mp_printf(MP_PYTHON_PRINTER, "stop-condition: %d\n", int_stop);

    return machine_hard_i2c_readfrom_mem(args[0], int_dev_address, int_memaddr, (size_t)int_nbytes);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_readfrom_mem_obj, 4, 4, mp_machine_hard_i2c_readfrom_mem);

STATIC mp_obj_t mp_machine_hard_i2c_readfrom_into(size_t n_args, const mp_obj_t *args)
{
    // casting Micropython data types to c data types
    // get device address
    uint8_t int_dev_address = mp_obj_get_int(args[1]);
    // mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);

    // get buffer to read to
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(args[2], &i2c_data, MP_BUFFER_READ);
    // mp_printf(MP_PYTHON_PRINTER, "1. byte of buffer: %d\n", *(uint8_t *)i2c_data.buf);

    // get stop
    uint8_t int_stop = mp_obj_get_int(args[3]);

    // pass to c-interface function
    machine_hard_i2c_readfrom_into(args[0], int_dev_address, i2c_data.buf, i2c_data.len, int_stop);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_readfrom_into_obj, 4, 4, mp_machine_hard_i2c_readfrom_into);

STATIC mp_obj_t mp_machine_hard_i2c_readinto(mp_obj_t self, mp_obj_t buf, mp_obj_t nack)
{
    // get read buffer pointer from mp
    mp_buffer_info_t i2c_read_buf;
    mp_get_buffer_raise(buf, &i2c_read_buf, MP_BUFFER_WRITE);

    // get NACK
    uint8_t int_nack = mp_obj_get_int(nack);

    // pass to c-interface function
    machine_hard_i2c_readinto(self, (uint8_t *)i2c_read_buf.buf, i2c_read_buf.len, int_nack);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_readinto_obj, mp_machine_hard_i2c_readinto);

STATIC mp_obj_t mp_machine_hard_i2c_readfrom(size_t n_args, const mp_obj_t *args)
{

    // casting Micropython data types to c data types
    uint16_t int_dev_address = mp_obj_get_int(args[1]);
    // mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
    uint16_t int_nbytes = mp_obj_get_int(args[2]);
    // mp_printf(MP_PYTHON_PRINTER, "nbytes: %d\n", int_nbytes);

    // calling I2C-Read Function
    vstr_t vstr;
    vstr_init_len(&vstr, int_nbytes);

    return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_readfrom_obj, 4, 4, mp_machine_hard_i2c_readfrom);

/* Write Function */

STATIC mp_obj_t mp_machine_hard_i2c_writeto_mem(size_t n_args, const mp_obj_t *args)
{

    if (n_args == 4)
    {
        // casting Micropython data types to c data types
        uint16_t int_dev_address = mp_obj_get_int(args[1]);
        // mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
        uint16_t int_reg_address = mp_obj_get_int(args[2]);
        // mp_printf(MP_PYTHON_PRINTER, "register address: %d\n", int_reg_address);
        mp_buffer_info_t i2c_data;
        mp_get_buffer_raise(args[3], &i2c_data, MP_BUFFER_READ);
        // mp_printf(MP_PYTHON_PRINTER, "1. byte of buffer: %d\n", *(uint8_t *)i2c_data.buf);

        // calling I2C-Send Function
        machine_hard_i2c_write(args[0], int_dev_address, true, int_reg_address, true, (uint8_t *)i2c_data.buf, i2c_data.len);
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Wrong number of arguments\n"));
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_writeto_mem_obj, 4, 4, mp_machine_hard_i2c_writeto_mem);

STATIC mp_obj_t mp_machine_hard_i2c_writeto(size_t n_args, const mp_obj_t *args)
{
    if (n_args == 3)
    {
        // casting Micropython data types to c data types
        uint8_t int_dev_address = mp_obj_get_int(args[1]);
        // mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
        mp_buffer_info_t i2c_data;
        mp_get_buffer_raise(args[2], &i2c_data, MP_BUFFER_READ);
        // mp_printf(MP_PYTHON_PRINTER, "1. byte of buffer: %d\n", *(uint8_t *)i2c_data.buf);

        // calling I2C-Send Function
        machine_hard_i2c_write(args[0], int_dev_address, true, 0, false, (uint8_t *)i2c_data.buf, i2c_data.len);
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Wrong number of arguments\n"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_writeto_obj, 3, 3, mp_machine_hard_i2c_writeto);

STATIC mp_obj_t mp_machine_hard_i2c_write(mp_obj_t self_in, mp_obj_t wr_buf)
{
    uint8_t num_of_ack = 0;

    // get write buffer
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(wr_buf, &i2c_data, MP_BUFFER_READ);

    // write bytes to bus
    num_of_ack = i2c_write_bytes_to_bus(self_in, i2c_data.buf, i2c_data.len);

    return mp_obj_new_int((mp_int_t)num_of_ack);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_hard_i2c_write_obj, mp_machine_hard_i2c_write);

